Revit 2026 API

# WallUtilsAllowWallJoinAtEnd Method

---

Allows the wall's end to join to other walls. If that end is near other walls it will become joined as a result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void AllowWallJoinAtEnd(
	Wall wall,
	int end
)
```
```vb
Public Shared Sub AllowWallJoinAtEnd (
	wall As Wall,
	end As Integer
)
```
```cpp
public:
static void AllowWallJoinAtEnd(
	Wall^ wall,
	int end
)
```
```fsharp
static member AllowWallJoinAtEnd :
        wall : Wall *
        end : int -> unit
```

#### Parameters

wall Wall
     The wall in question
end Int32
     0 or 1 for the beginning or end of the wall's curve

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

By default all walls are allowed to join at ends, so this function is only needed if this wall end is already disallowed to join. If this wall is a stacked wall, all subwalls at this end will be allowed to join.

#### Reference

WallUtils Class

Autodesk.Revit.DB Namespace